0/Fluid/T
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/fluid";
	object	T;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 0 0 1 0 0 0];
internalField	uniform 300.0;
boundaryField
{
	Re_inlet
	{
		type	fixedValue;
		value	uniform 300.0;
	}
	Re_Outlet
	{
		type	zeroGradient;
	}
	Re_top_walls
	{
		type	zeroGradient;
	}

	Re_bottom_walls
	{
		type	zeroGradient;
	}

	Re_Interface
	{
		type	compressible::turbulentTemperatureCoupledBaffleMixed;
		value	uniform 300.0;
		kappaMethod	fluidThermo;
		kappa	none;
		neighbourFieldName	T;
		Tnbr	T;
		thicknessLayers	();
		kappaLayers	();
		thicknessLayers	();
		kappaLayers	();
	}
}
