0/Fluid/U
FoamFile
{
	version	2.0;
	format	binary;
	class	volVectorField;
	location	"0/fluid";
	object	U;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 1 -1 0 0 0 0];
internalField	uniform (0.0 0.0 0.0);
boundaryField
{
	Re_inlet
	{
		type	surfaceNormalFixedValue;
		refValue	uniform -0.1;
	}
	Re_Outlet
	{
		type	zeroGradient;
	}
	Re_top_walls
	{
		type	noSlip;
	}

	Re_bottom_walls
	{
		type	noSlip;
	}


	Re_Interface
	{
		type	noSlip;
	}
}
