0/Fluid/p
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/fluid";
	object	p;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -2 0 0 0 0];
internalField	uniform 100000.0;
boundaryField
{
	Re_inlet
	{
		type	calculated;
		value	uniform 100000.0;
	}
	Re_Outlet
	{
		type	calculated;
		value	uniform 100000.0;
	}
	Re_top_walls
	{
		type	calculated;
		value	uniform 100000.0;
	}
	Re_bottom_walls
	{
		type	calculated;
		value	uniform 100000.0;
	}

	Re_Interface
	{
		type	calculated;
		value	uniform 100000.0;
	}
}
