0/Solid/T
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/solid";
	object	T;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 0 0 1 0 0 0];
internalField	uniform 400.0;
boundaryField
{

	Re_Interface
	{
		type	compressible::turbulentTemperatureCoupledBaffleMixed;
		value	uniform 400.0;
		kappaMethod	solidThermo;
		kappa	none;
		neighbourFieldName	T;
		Tnbr	T;
	}

	Re_Solid
	{
		type	compressible::turbulentTemperatureCoupledBaffleMixed;
		value	uniform 400.0;
		kappaMethod	solidThermo;
		kappa	none;
		neighbourFieldName	T;
		Tnbr	T; 
	}
}
