0/Solid/p
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/solid";
	object	p;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -2 0 0 0 0];
internalField	uniform 0.0;
boundaryField
{

	Re_Solid
	{
		type	zeroGradient;
	}

	Re_Interface
	{
		type	zeroGradient;
	}
}
