constant/Fluid/boundaryRadiationProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant/fluid";
	object	boundaryRadiationProperties;
}
inlet
{
}
outlet
{
}
boundaries
{
}
empty
{
}
cylinder_1
{
}
