constant/Fluid/g
FoamFile
{
	version	2.0;
	class	uniformDimensionedVectorField;
	format	ascii;
	location	"constant/fluid";
	object	g;
}
dimensions	[0 1 -2 0 0 0 0];
value	(0.0 -9.81 0.0);
