constant/Fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    Re_inlet
    {
        type            patch;
        nFaces          8572;
        startFace       785152;
    }
    Re_Outlet
    {
        type            patch;
        nFaces          8494;
        startFace       793724;
    }
    Re_Interface
    {
      type	mappedWall;
       sampleRegion	Solid;
       samplePatch	Re_Interface;
       sampleMode	nearestPatchFace;
       offsetMode	uniform;
       offset	(0.0 0.0 0.0);
        nFaces          5100;
        startFace       802218;
    }
    Re_bottom_walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          21949;
        startFace       807318;
    }
    Re_top_walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          14120;
        startFace       829267;
    }
)

// ************************************************************************* //
