constant/Fluid/turbulenceProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant/fluid";
	object	turbulenceProperties;
}
simulationType	laminar;
