constant/Fluid/viewFactorsDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant/fluid";
	object	viewFactorsDict;
}
writeViewFactorMatrix	true;
writeFacesAgglomeration	true;
writePatchViewFactors	false;
maxDynListLength	1000000;
facesPerCluster	5;
boundaries
{
	nFacesInCoarsestLevel	80;
	featureAngle	20.0;
}
cylinder_1
{
	nFacesInCoarsestLevel	6;
	featureAngle	20.0;
}
empty
{
	nFacesInCoarsestLevel	6432;
	featureAngle	20.0;
}
inlet
{
	nFacesInCoarsestLevel	16;
	featureAngle	20.0;
}
outlet
{
	nFacesInCoarsestLevel	16;
	featureAngle	20.0;
}
