constant/Solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    Re_Interface
    {
      type	mappedWall;
      sampleRegion	Fluid;
      samplePatch	Re_Interface;
      sampleMode	nearestPatchFace;
      offsetMode	uniform;
      offset	(0.0 0.0 0.0);
        nFaces          4988;
        startFace       322890;
    }
    Re_Solid
    {
        type            wall;
        inGroups        1(wall);
        nFaces          27890;
        startFace       327878;
    }
)

// ************************************************************************* //
