system/Solid/decomposeParDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system/solid";
	object	decomposeParDict;
}
numberOfSubdomains	4;
method	scotch;
distributed	false;
