system/Solid/fvOptions
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system/solid";
	object	fvOptions;
}
