system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.0
// Source file:
// Export date: 2022-11-11 16:05:44.811481

scale 1;

vertices
(
     (-1.01 -0.82578 -1.3205)
     (1.01 -0.82578 -1.3205)
     (1.01 0.82578 -1.3205)
     (-1.01 0.82578 -1.3205)    //These are new changes Dr.Victor
     (-1.01 -0.82578 1.2105)
     (1.01 -0.82578 1.2105)
     (1.01 0.82578 1.2105)
     (-1.01 0.82578 1.2105)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    world
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
