system/fvSolution
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	fvSolution;
}
solvers
{
}
PIMPLE
{
	nOuterCorrectors	1;
	energyCoupling
	{
		iterations	10;
		interval	0;
	}
}
