system/snappyHexMeshDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.0
// Source file:
// Export date: 2022-11-11 16:05:44.811481

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    Re_inlet
    {
        type triSurfaceMesh;
        file "Re_inlet.stl";
        // Min Bounds = [-6.02553e-01 -6.02553e-01  1.28544e-01]
        // Max Bounds = [ 6.02553e-01  6.02553e-01  1.28544e-01]
        // Area = 1.13330e+00
    }
    Re_Outlet
    {
        type triSurfaceMesh;
        file "Re_Outlet.stl";
        // Min Bounds = [-6.02553e-01 -6.02553e-01  1.28544e-01]
        // Max Bounds = [ 6.02553e-01  6.02553e-01  1.28544e-01]
        // Area = 1.13330e+00
    }
    Re_Interface
    {
        type triSurfaceMesh;
        file "Re_Interface.stl";
        // Min Bounds = [-6.02553e-01 -6.02553e-01 -1.28544e-01]
        // Max Bounds = [ 6.02553e-01  6.02553e-01  1.28544e-01]
        // Area = 9.71757e-01
    }

    Re_Solid
    {
        type triSurfaceMesh;
        file "Re_Solid.stl";
        // Min Bounds = [-1.00000e+00 -8.17599e-01 -1.28544e-01]
        // Max Bounds = [ 1.00000e+00  8.17599e-01  1.28544e-01]
        // Area = 4.30692e+00
    }
    Re_bottom_walls
    {
        type triSurfaceMesh;
        file "Re_bottom_walls.stl";
        // Min Bounds = [-1.00000e+00 -8.17599e-01 -1.28544e-01]
        // Max Bounds = [ 1.00000e+00  8.17599e-01  1.28544e-01]
        // Area = 4.30692e+00
    }

    Re_top_walls
    {
        type triSurfaceMesh;
        file "Re_top_walls.stl";
        // Min Bounds = [-1.00000e+00 -8.17599e-01 -1.28544e-01]
        // Max Bounds = [ 1.00000e+00  8.17599e-01  1.28544e-01]
        // Area = 4.30692e+00
    }
}

castellatedMeshControls
{
    maxLocalCells   10000000;
    maxGlobalCells  10000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.1;
    nCellsBetweenLevels 4;
    locationInMesh (0 0 0.442153);
    allowFreeStandingZoneFaces true;
    resolveFeatureAngle 30;
    features
    (
        {
            file "Re_inlet.eMesh";
            level 0;
        }
        {
            file "Re_Outlet.eMesh";
            level 0;
        }
        {
            file "Re_Interface.eMesh";
            level 0;
        }

        {
            file "Re_Solid.eMesh";
            level 0;
        }

        {
            file "Re_top_walls.eMesh";
            level 0;
        }

        {
            file "Re_bottom_walls.eMesh";
            level 0;
        }

    );
    refinementSurfaces
    {
        Re_inlet
        {
            level (2 2);
            patchInfo { type patch; }
        }
        Re_Outlet
        {
            level (2 2);
            patchInfo { type patch; }
        }
        Re_Interface
        {
            level (2 2);
            patchInfo { type wall; }
        }

        Re_Solid
        {
            level (2 2);
            patchInfo { type wall; }
        }

        Re_top_walls
        {
            level (2 2);
            patchInfo { type wall; }
        }

        Re_bottom_walls
        {
            level (2 2);
            patchInfo { type wall; }
        }

    }
    refinementRegions
    {

    }
}

snapControls
{
    nSmoothPatch    5;
    tolerance       1;
    nSolveIter      500;
    nRelaxIter      10;
    nFeatureSnapIter 10;
    implicitFeatureSnap true;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
}

addLayersControls
{
    relativeSizes   true;
    expansionRatio  1;
    finalLayerThickness 0.3;
    minThickness    0.1;
    nGrow           0;
    featureAngle    60;
    slipFeatureAngle 30;
    nRelaxIter      3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals  3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter      50;
    layers
    {
        Re_inlet
        {
             nSurfaceLayers 0;
        }
        Re_Outlet
        {
             nSurfaceLayers 0;
        }
        Re_Interface
        {
             nSurfaceLayers 0;
        }

        Re_Solid
        {
             nSurfaceLayers 0;
        }

        Re_top_walls
        {
             nSurfaceLayers 0;
        }

        Re_bottom_walls
        {
             nSurfaceLayers 0;
        }

    }
}

meshQualityControls
{
    maxNonOrtho     65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave      80;
    minVol          1e-15;
    minTetQuality   1e-15;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001;
    minFaceWeight   0.05;
    minVolRatio     0.01;
    minTriangleTwist -1;
    nSmoothScale    4;
    errorReduction  0.75;
}

writeFlags      ( scalarLevels layerSets layerFields );

mergeTolerance  1e-06;
