system/surfaceFeatureExtractDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          surfaceFeaturesDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.0
// Source file:
// Export date: 2022-11-11 16:05:44.811481




Re_Interface.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}

Re_inlet.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}

Re_Outlet.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}

Re_Solid.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}

Re_top_walls.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}

Re_bottom_walls.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}
